src/cf/InformationRegisters/МашиночитаемыеДоверенностиСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>МашиночитаемыеДоверенностиСтатусы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТехническийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТехническиеСтатусыМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторТранзакции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусТранзакции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТранзакцииСРеестромМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТранзакции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТранзакцийСРеестромМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаТранзакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОшибкиЗапросаСтатуса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МашиночитаемыеДоверенностиСтатусы/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоДоверенности = Отбор.Найти("МашиночитаемаяДоверенность");
	Записи = Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Записи.МашиночитаемаяДоверенность КАК МашиночитаемаяДоверенность,
	               |	Записи.ТехническийСтатус КАК НовыйСтатус
	               |ПОМЕСТИТЬ ВТЗаписи
	               |ИЗ
	               |	&Записи КАК Записи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ТекущиеЗаписи.МашиночитаемаяДоверенность, ВТЗаписи.МашиночитаемаяДоверенность) КАК МашиночитаемаяДоверенность,
	               |	ТекущиеЗаписи.СтатусДоИзменения КАК СтатусДоИзменения,
	               |	ВТЗаписи.НовыйСтатус КАК НовыйСтатус
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус КАК СтатусДоИзменения,
	               |		МашиночитаемыеДоверенностиСтатусы.МашиночитаемаяДоверенность КАК МашиночитаемаяДоверенность
	               |	ИЗ
	               |		РегистрСведений.МашиночитаемыеДоверенностиСтатусы КАК МашиночитаемыеДоверенностиСтатусы
	               |	ГДЕ
	               |		(&МашиночитаемаяДоверенность = НЕОПРЕДЕЛЕНО
	               |				ИЛИ МашиночитаемыеДоверенностиСтатусы.МашиночитаемаяДоверенность = &МашиночитаемаяДоверенность)) КАК ТекущиеЗаписи
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТЗаписи КАК ВТЗаписи
	               |		ПО ТекущиеЗаписи.МашиночитаемаяДоверенность = ВТЗаписи.МашиночитаемаяДоверенность
	               |ГДЕ
	               |	ЕСТЬNULL(ВТЗаписи.НовыйСтатус, ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.ПустаяСсылка)) <> ЕСТЬNULL(ТекущиеЗаписи.СтатусДоИзменения, ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.ПустаяСсылка))";
	
	Если ОтборПоДоверенности = Неопределено Тогда
		Запрос.УстановитьПараметр("МашиночитаемаяДоверенность", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("МашиночитаемаяДоверенность", ОтборПоДоверенности.Значение);
	КонецЕсли;
	Запрос.УстановитьПараметр("Записи", Записи);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ИзменившиесяСтатусы = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Статусы = Новый Структура;
		Статусы.Вставить("СтатусДоИзменения", Выборка.СтатусДоИзменения);
		Статусы.Вставить("НовыйСтатус", Выборка.НовыйСтатус);
		ИзменившиесяСтатусы.Вставить(Выборка.МашиночитаемаяДоверенность, Статусы);
	КонецЦикла; 
	
	Если ИзменившиесяСтатусы.Количество() > 0 Тогда
		МашиночитаемыеДоверенностиФНССлужебный.ПриИзмененииСтатусаДоверенности(ИзменившиесяСтатусы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
